my_list = ['Россия', 'Турция', 'Корея', 'Китай', 'Япония', 'Франция']
print('Список:', my_list)
print('Первый элемент:', my_list[0])
print('Последний элемент:', my_list[5])
print('Страны Азии:', my_list[2:5])
my_list[2] = 'Италия'
print('Обновленный список:', my_list)
print(' ')
my_dict = {'Россия': 'Москва',
           'Турция': 'Анкара',
           'Корея': 'Сеул',
           'Китай': 'Пекин',
           'Япония': 'Токио',
           'Франция': 'Париж'}
print('Словарь:', my_dict)
print('Столица России:', my_dict['Россия'])
my_dict['Италия'] = 'Рим'
print('Обновленный словарь:', my_dict)
